<a href="https://colab.research.google.com/github/rp202910/Assignment1/blob/master/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd
import numpy as np

In [3]:
from google.colab import files
uploaded = files.upload()

Saving nba.csv to nba.csv

In [6]:
data=pd.read_csv("/nba.csv")
data

              Name            Team  ...            College     Salary
0    Avery Bradley  Boston Celtics  ...              Texas  7730337.0
1      Jae Crowder  Boston Celtics  ...          Marquette  6796117.0
2     John Holland  Boston Celtics  ...  Boston University        NaN
3      R.J. Hunter  Boston Celtics  ...      Georgia State  1148640.0
4    Jonas Jerebko  Boston Celtics  ...                NaN  5000000.0
..             ...             ...  ...                ...        ...
453   Shelvin Mack       Utah Jazz  ...             Butler  2433333.0
454      Raul Neto       Utah Jazz  ...                NaN   900000.0
455   Tibor Pleiss       Utah Jazz  ...                NaN  2900000.0
456    Jeff Withey       Utah Jazz  ...             Kansas   947276.0
457            NaN             NaN  ...                NaN        NaN

[458 rows x 9 columns]

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [9]:
#casel: remove if all data are null
data.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [10]:
len(data)

458

In [11]:
data1=data.dropna(axis=0)

In [12]:
data1=data.dropna(axis=0,how="all")

In [14]:
len(data1)

457

In [16]:
data1.isnull().sum()

Name         0
Team         0
Number       0
Position     0
Age          0
Height       0
Weight       0
College     84
Salary      11
dtype: int64

In [17]:
data1=data.dropna(axis=0,how="any")

In [18]:
len(data1)

364

In [19]:
data1.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
dtype: int64

In [ ]:
#case2: remove rows if ay data is null

In [20]:
#remove columns when any data is null
data1=data.dropna(axis=0,how="any",subset=["College"])
len(data1)

373

In [21]:
data1.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      9
dtype: int64

In [22]:
#remove the rows if in the Salary column  null value is there
data1=data.dropna(axis=0,how="any",subset=["Salary"])
len(data1)

446

In [23]:
data1.isnull().sum()

Name         0
Team         0
Number       0
Position     0
Age          0
Height       0
Weight       0
College     82
Salary       0
dtype: int64

In [24]:
data_new=data.sort_values("Salary",ascending=False)

In [26]:
data_new

                Name                    Team  ...                College      Salary
109      Kobe Bryant      Los Angeles Lakers  ...                    NaN  25000000.0
169     LeBron James     Cleveland Cavaliers  ...                    NaN  22970500.0
33   Carmelo Anthony         New York Knicks  ...               Syracuse  22875000.0
251    Dwight Howard         Houston Rockets  ...                    NaN  22359364.0
339       Chris Bosh              Miami Heat  ...           Georgia Tech  22192730.0
..               ...                     ...  ...                    ...         ...
350    Briante Weber              Miami Heat  ...  Virginia Commonwealth         NaN
353    Dorell Wright              Miami Heat  ...                    NaN         NaN
397     Axel Toupane          Denver Nuggets  ...                    NaN         NaN
409       Greg Smith  Minnesota Timberwolves  ...           Fresno State         NaN
457              NaN                     NaN  ...                    NaN         NaN

[458 rows x 9 columns]

In [28]:
#loc and iloc function
data_new.iloc[3]

Name          Dwight Howard
Team        Houston Rockets
Number                   12
Position                  C
Age                      30
Height                 6-11
Weight                  265
College                 NaN
Salary          2.23594e+07
Name: 251, dtype: object

In [29]:
data_new.loc[251]

Name          Dwight Howard
Team        Houston Rockets
Number                   12
Position                  C
Age                      30
Height                 6-11
Weight                  265
College                 NaN
Salary          2.23594e+07
Name: 251, dtype: object

In [30]:
data.iloc[3:10,2:5]

   Number Position   Age
3    28.0       SG  22.0
4     8.0       PF  29.0
5    90.0       PF  29.0
6    55.0       PF  21.0
7    41.0        C  25.0
8    12.0       PG  22.0
9    36.0       PG  22.0

In [31]:
data.iloc[3:10][["Number","Position","Age"]]

   Number Position   Age
3    28.0       SG  22.0
4     8.0       PF  29.0
5    90.0       PF  29.0
6    55.0       PF  21.0
7    41.0        C  25.0
8    12.0       PG  22.0
9    36.0       PG  22.0

In [32]:
#reset the index value(back to original)
data_new=data_new.reset_index()
data_new

     index             Name  ...                College      Salary
0      109      Kobe Bryant  ...                    NaN  25000000.0
1      169     LeBron James  ...                    NaN  22970500.0
2       33  Carmelo Anthony  ...               Syracuse  22875000.0
3      251    Dwight Howard  ...                    NaN  22359364.0
4      339       Chris Bosh  ...           Georgia Tech  22192730.0
..     ...              ...  ...                    ...         ...
453    350    Briante Weber  ...  Virginia Commonwealth         NaN
454    353    Dorell Wright  ...                    NaN         NaN
455    397     Axel Toupane  ...                    NaN         NaN
456    409       Greg Smith  ...           Fresno State         NaN
457    457              NaN  ...                    NaN         NaN

[458 rows x 10 columns]

In [33]:
#delete the whole column
data_new=data_new.drop(["index"],axis=1)
data_new.head()

              Name                 Team  ...       College      Salary
0      Kobe Bryant   Los Angeles Lakers  ...           NaN  25000000.0
1     LeBron James  Cleveland Cavaliers  ...           NaN  22970500.0
2  Carmelo Anthony      New York Knicks  ...      Syracuse  22875000.0
3    Dwight Howard      Houston Rockets  ...           NaN  22359364.0
4       Chris Bosh           Miami Heat  ...  Georgia Tech  22192730.0

[5 rows x 9 columns]

In [34]:
data_new.loc[251]

Name            Ramon Sessions
Team        Washington Wizards
Number                       7
Position                    PG
Age                         30
Height                     6-3
Weight                     190
College                 Nevada
Salary             2.17046e+06
Name: 251, dtype: object

In [36]:
data.to_csv("mynewdata.csv")